{
  "architectures": [
    "TinyLlavaForConditionalGeneration"
  ],
  "cache_dir": null,
  "connector_type": "mlp2x_gelu",
  "hidden_size": 1152,
  "ignore_index": -100,
  "image_aspect_ratio": "square",
  "image_token_index": -200,
  "llm_model_name_or_path": "/root/autodl-tmp/TinyLLaVA_Factory/third_party/LLM-Research/gemma-3-1b-pt",
  "model_type": "tinyllava",
  "num_queries": 128,
  "num_resampler_layers": 3,
  "pad_token": "<pad>",
  "pad_token_id": 0,
  "resampler_hidden_size": 768,
  "text_config": {
    "_name_or_path": "/root/autodl-tmp/TinyLLaVA_Factory/third_party/LLM-Research/gemma-3-1b-pt",
    "_sliding_window_pattern": 6,
    "architectures": [
      "Gemma3ForCausalLM"
    ],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "attn_logit_softcapping": null,
    "cache_implementation": "hybrid",
    "final_logit_softcapping": null,
    "head_dim": 256,
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_activation": "gelu_pytorch_tanh",
    "hidden_size": 1152,
    "initializer_range": 0.02,
    "intermediate_size": 6912,
    "layer_types": [
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention"
    ],
    "max_position_embeddings": 32768,
    "model_type": "gemma3_text",
    "num_attention_heads": 4,
    "num_hidden_layers": 26,
    "num_key_value_heads": 1,
    "query_pre_attn_scalar": 256,
    "rms_norm_eps": 1e-06,
    "rope_local_base_freq": 10000,
    "rope_scaling": null,
    "rope_theta": 1000000,
    "sliding_window": 512,
    "torch_dtype": "bfloat16",
    "use_cache": true,
    "vocab_size": 262144
  },
  "tokenizer_model_max_length": 2048,
  "tokenizer_name_or_path": "/root/autodl-tmp/TinyLLaVA_Factory/third_party/LLM-Research/gemma-3-1b-pt",
  "tokenizer_padding_side": "right",
  "tokenizer_use_fast": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.55.2",
  "tune_type_connector": "full",
  "tune_type_llm": "full",
  "tune_type_vision_tower": "frozen",
  "tune_vision_tower_from_layer": 0,
  "use_cache": true,
  "vision_config": {
    "attention_dropout": 0.0,
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_size": 1152,
    "image_size": 384,
    "intermediate_size": 4304,
    "layer_norm_eps": 1e-06,
    "model_name_or_path": "/root/autodl-tmp/TinyLLaVA_Factory/third_party/google/siglip2-so400m-patch14-384",
    "model_name_or_path2": "",
    "model_type": "siglip_vision_model",
    "num_attention_heads": 16,
    "num_channels": 3,
    "num_hidden_layers": 27,
    "patch_size": 14
  },
  "vision_feature_layer": -2,
  "vision_feature_select_strategy": "patch",
  "vision_hidden_size": 1152,
  "vision_model_name_or_path": "/root/autodl-tmp/TinyLLaVA_Factory/third_party/google/siglip2-so400m-patch14-384",
  "vision_model_name_or_path2": "",
  "vocab_size": 262144
}
